# Создайте программу для игры в ""Крестики-нолики""
# -Отрисовка поля
# -создание словаря
# -функция ходов игры
# -функция победы
# -проверки()

from typing import Dict


def desk(dic):
    a0 = f"  X1  X2  X3"
    a1 = f"Y1 {dic['y1']['x1']} | {dic['y1']['x2']} | {dic['y1']['x3']}"
    a1_1 = f"---------------"
    a2 = f"Y2 {dic['y2']['x1']} | {dic['y2']['x2']} | {dic['y2']['x3']}"
    a2_1 = f"---------------"
    a3 = f"Y3 {dic['y3']['x1']} | {dic['y3']['x2']} | {dic['y3']['x3']}"
    print(a0)
    print(a1)
    print(a1_1)
    print(a2)
    print(a2_1)
    print(a3)


dict = {
    'y1': {'x1': ' ', 'x2': ' ', 'x3': ' '},
    'y2': {'x1': ' ', 'x2': ' ', 'x3': ' '},
    'y3': {'x1': ' ', 'x2': ' ', 'x3': ' '}
}

desk(dict)
